app/views/blogs/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 1]]
---
			<div class="col-md-12 blog-margin">
				<span class="glyphicon glyphicon-comment font_4" aria-hidden="true"> <%= @blog.comments.count %> comments</span>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 1]]
---
					<%= link_to blog_favorites_path(@blog), method: :delete do %>
						<span class="glyphicon glyphicon-heart font_4" aria-hidden="true" style="color: red;"> <%= @blog.favorites.count %></span>