app/views/users/home.html.erb

							<tr>
								<td class="font_4"><span class="glyphicon glyphicon-comment" aria-hidden="true"> <%= blog.comments.count %></span></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 1]]