app/views/users/index.html.erb

										<td><%= link_to user.name, user_path(user) %></td>
										<td><%= user.blogs.count %> blogs</td>
---
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."user_id" = ?  [["user_id", 1]]