app/views/users/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 1]]
---
							<tr>
								<td><span class="glyphicon glyphicon-comment font_4" aria-hidden="true"> <%= blog.comments.count %></span></td>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 1]]
---
										<%= link_to blog_favorites_path(blog), method: :delete do %>
											<span class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"> <%= blog.favorites.count %></span>