app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" ORDER BY "blogs"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]
---
  def index
    @blogs = Blog.page(params[:page]).reverse_order

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."blog_id" = ? ORDER BY "comments"."id" DESC LIMIT ? OFFSET ?  [["blog_id", 1], ["LIMIT", 7], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @blog = Blog.find(params[:id])
    @info_user = @blog.user
    @login_user = current_user
    @create_user = current_user
    @create_new = Blog.new
    @comment = Comment.new
    @comments = @blog.comments.page(params[:page]).reverse_order

INSERT INTO "blogs" ("user_id", "title", "blog_body", "created_at", "updated_at", "blog_image_id", "category") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    blog = Blog.new(blog_params)
    blog.user_id = current_user.id
    blog.save

    category = Category.new(category_params)
    category.category = blog.category
    category.blog_id = blog.id
    category.user_id = current_user.id
    binding.pry
    category.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "blogs" SET "blog_image_id" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["blog_image_id", "01932e9c45d389b0bd16b24f953fd6461a2079bd85c3183eb4cd8ae7c836"], ["updated_at", "2019-07-29 10:22:00.148224"], ["id", 3]]
---
  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)