app/controllers/comments_controller.rb

	def create
	    @blog = Blog.find(params[:blog_id])
	    @comment = current_user.comments.new(comment_params)
	    @comment.blog_id = @blog.id
	    if @comment.save
	    	redirect_to blog_path(@blog.id), notice: 'You have creatad comment successfully.'
	    else
	    	@info_user = @blog.user
		    @login_user = current_user
		    @create_user = current_user
		    @create_new = Blog.new
		    @comments = @blog.comments.page(params[:page]).reverse_order
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "blog_id", "comment_body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["blog_id", 1], ["comment_body", "あいうえおかきくけこさしすせそたちつてと"], ["created_at", "2019-07-28 22:36:02.375859"], ["updated_at", "2019-07-28 22:36:02.375859"]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ? ORDER BY RANDOM() LIMIT ?  [["user_id", 3], ["LIMIT", 10]]
SELECT  "comments".* FROM "comments" WHERE "comments"."blog_id" = ? ORDER BY "comments"."id" DESC LIMIT ? OFFSET ?  [["blog_id", 3], ["LIMIT", 7], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]