app/controllers/favorites_controller.rb

	def create
		blog = Blog.find(params[:blog_id])
		favorite = current_user.favorites.new(blog_id: blog.id)
		favorite.save
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["blog_id", 1], ["created_at", "2019-07-28 22:18:44.661461"], ["updated_at", "2019-07-28 22:18:44.661461"]]