app/controllers/users_controller.rb

	def home
    @blogs = Blog.page(params[:page]).reverse_order
---
SELECT  "blogs".* FROM "blogs" ORDER BY "blogs"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]

  def index
    @users = User.page(params[:page]).reverse_order
    @info_user = current_user
    @create_user = current_user
    @create_new = Blog.new
    @side_images = Blog.order("RANDOM()").limit(10)
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]
SELECT  "blogs".* FROM "blogs" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 10]]

  def show
    @user = User.find(params[:id])
    @blogs = @user.blogs.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ? ORDER BY "blogs"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 7], ["OFFSET", 0]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_text" = ?, "profile_image_id" = ?, "mini_profile_text" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_text", ""], ["profile_image_id", nil], ["mini_profile_text", ""], ["updated_at", "2019-07-29 09:17:54.833071"], ["id", 2]]